Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: You can test non-destructively whether an exception has been set with :cfunc:`PyErr_Occurred`. This returns the current exception object, or *NULL* if no exception has occurred. You normally don't need to call :cfunc:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
pl: Możesz sprawdzić nie-destrukcyjnie czy wyjątek został ustawiony za pomocą zadania :cfunc:`PyErr_Occured`. To zwraca przedmiot obecnego wyjątku, lub *NULL* jeśli żaden wyjątek nie nastąpił. Zwykle nie musisz wywoływać zadania :cfunc:`PyErr_Occurred` aby zobaczyć czy błąd nastąpił w wywołaniu zadania, ponieważ powinno się być w stanie określić na podstawie zwracanej wartości.

source: When a function *f* that calls another function *g* detects that the latter fails, *f* should itself return an error value (usually *NULL* or ``-1``). It should *not* call one of the :cfunc:`PyErr_\*` functions --- one has already been called by *g*. *f*'s caller is then supposed to also return an error indication to *its* caller, again *without* calling :cfunc:`PyErr_\*`, and so on --- the most detailed cause of the error was already reported by the function that first detected it. Once the error reaches the Python interpreter's main loop, this aborts the currently executing Python code and tries to find an exception handler specified by the Python programmer.
pl: Gdy zadanie *f* które wywołuje inne zadanie *g* wykryje że to drugie zawiedzie, *f* powinno samo zwrócić wartość błędu (zwykle *NULL* lub ``-1``). *Nie* powinno wywoływać jednego z zadań :cfunc:`PyErr_\*` --- gdyż jedno już zostało wywołane przez *g*. Wywołujący zadanie *f* jest potem zobowiązany także zwrócić wskazanie błędu temu kto *je* wywołał, znów *bez* wywoływania zadania :cfunc:`PyErr_\*` itd --- najbardziej szczegółowy powód błędu został już zaraportowany przez zadanie, które pierwsze wykryło go. Gdy błąd dotrze do pętli głównej programu interpretującego polecenia języka pytonowskiego, to przerywa obecne wykonanie kodu języka pytonowskiego i próbuje znaleźć obsługę błędu określoną przez programistę języka pytonowskiego.

source: (There are situations where a module can actually give a more detailed error message by calling another :cfunc:`PyErr_\*` function, and in such cases it is fine to do so. As a general rule, however, this is not necessary, and can cause information about the cause of the error to be lost: most operations can fail for a variety of reasons.)
pl: (Istnieją sytuacje gdy moduł może właściwie dawać bardziej szczegółową wiadomość o błędzie przez wywołanie kolejnego zadania :cfunc:`PyErr_\*` i w takich przypadkach nie sprawia to kłopotu. Jako naczelna zasada, jednakże, nie jest to konieczne, i może powodować utratę informacji o powodzie błędu: większość operacji może zawieźć z różnych powodów.)

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :cfunc:`PyErr_Clear`. The only time C code should call :cfunc:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
pl: Aby zignorować wyjątek ustanowiony przez wywołanie zadania które zawiodło, warunek wyjątku musi być wyczyszczony jawnie przez wywołanie :cfunc:`PyErr_Clear`. Jedynym momentem gdy kod C powinien wzywać :cfunc:`PyErr_Clear` jest jeśli nie chce przekazać błędu dla programu interpretującego polecenia języka pytonowskiego ale chce obsłużyć je całkowicie samodzielnie (możliwie przez próbowanie czegoś innego, lub udawanie że nic się nie stało).

source: Every failing :cfunc:`malloc` call must be turned into an exception --- the direct caller of :cfunc:`malloc` (or :cfunc:`realloc`) must call :cfunc:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :cfunc:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :cfunc:`malloc` directly.
pl: Każde zawodzące odwołanie :cfunc:`malloc` musi być zamienione na sytuację wyjątkową --- bezpośrednio wołający :cfunc:`malloc` (lub :cfunc:`realloc`) musi wywołać :cfunc:`PyErr_NoMemory` i zwrócić wskazanie o błędzie samo w sobie. Wszystkie zadania tworzące-przedmioty (dla przykładu. :cfunc:`PyLong_FromLong`) już to robią więc ta notatka jest ważna tylko dla tych którzy wzywają :cfunc:`malloc` bezpośrednio.

source: Also note that, with the important exception of :cfunc:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
pl: Zauważ także, że z istotnym wyjątkiem zadania :cfunc:`PyArg_ParseTuple` i przyjaciół, zadania które zwracają status liczbą całkowitą zwykle zwracają dodatnią wartość lub zero dla powodzenia i ``-1`` dla niepowodzenia, tak jak odwołania systemowe Unix-a.

source: Finally, be careful to clean up garbage (by making :cfunc:`Py_XDECREF` or :cfunc:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
pl: W końcu bądź ostrożny przy czyszczeniu śmieci (przez wywołania zadań :cfunc:`PyXDECREF` lub :cfunc:`Py_DECREF` dla przedmiotów które już utworzyłeś) gdy zwracasz wskaźnik błędu!

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :cdata:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :cdata:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :cdata:`PyExc_IOError`). If something's wrong with the argument list, the :cfunc:`PyArg_ParseTuple` function usually raises :cdata:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :cdata:`PyExc_ValueError` is appropriate.
pl: Wybór który wyjątek zgłosić jest całkowicie twój. Istnieją uprzednio zadeklarowane przedmioty C odpowiadające wszystkim wbudowanym wyjątkom języka pytonowskiego, takie, jak :cdata:`PyExc_ZeroDivisionError` którego możesz użyć bezpośrednio. Oczywiście, powinieneś wybierać wyjątki rozsądnie --- nie używaj :cdata:`PyExc_TypeError` aby oznaczyć że plik nie mógł być otworzony (to powinno prawdopodobnie być :cdata:`PyExc_IOError`). Jeśli coś jest nie wporządku z listą parametrów, zadanie :cfunc:`PyArg_ParseTuple` zwykle zgłasza :cdata:`PyExc_TypeError`. Jeśli masz parametr którego wartość musi być w szczególnym zakresie lub musi zaspokajać inne warunki :cdata:`PyExc_ValueError` jest odpowiednia.

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
pl: Możesz też określić nowy wyjątek który jest niepowtarzalny dla twojego modułu. Dla tego, zwykle deklarujesz przedmiot statycznej zmiennej na początku pliku::

source: and initialize it in your module's initialization function (:cfunc:`PyInit_spam`) with an exception object (leaving out the error checking for now)::
pl: i zainicjować je w twoim zadaniu zainicjowania modułu (:cfunc:`PyInit_spam`) przedmiotem wyjątku (pozostawiając na razie sprawdzanie błędów)::

source: Note that the Python name for the exception object is :exc:`spam.error`. The :cfunc:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of *NULL*), described in :ref:`bltin-exceptions`.
pl: Zauważ, że nazwa języka pytonowskiego dla przedmiotu wyjątku to :exc:`spam.error`. Zadanie :cfunc:`PyErr_NewException` może tworzyć uogólnienie z bazowym uogólnieniem będącym :exc:`Exception` (chyba, że inne uogólnienie jest przekazane zamiast *NULL*), opisane w :ref:`bltin-exceptions`.

source: Note also that the :cdata:`SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :cdata:`SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
pl: Zauważ także, że zmienna :cdata:`SpamError` zachowuje odniesienie do nowo utworzonego uogólnienia wyjątku; to jest specjalnie! Od kiedy wyjątek mógł być zdjęty z modułu przez zewnętrzny kod, posiadane odniesienie do uogólnienia jest konieczne aby zapewnić że nie będzie pominięte, powodując, że :cdata:`SpamError` stanie się wiszącym wskaźnikiem. Jeśli by tak się stało, kod C, który zgłasza wyjątek mógłby spowodować zrzucenie jądra lub inne niezamierzone efekty uboczne.

source: We discuss the use of PyMODINIT_FUNC as a function return type later in this sample.
pl: Rozważamy użycie PyMODINIT_FUNC jako typ zwracany później w tym przykładzie.

source: Back to the Example
pl: Z powrotem do Przykładu

source: Going back to our example function, you should now be able to understand this statement::
pl: Wracając do naszej przykładowego zadania, powinieneś już być w stanie zrozumieć to wyrażenie::

source: It returns *NULL* (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :cfunc:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :cdata:`command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :cdata:`command` should properly be declared as ``const char *command``).
pl: Zwraca ona *NULL* (wskaźnik błędu dla zadań zwracających przedmiotowe wskaźniki) jeśli błąd został wykryty na liście parametrów, polegając na wyjątku ustawionym przez :cfunc:`PyArg_ParseTuple`. Poza tym wartość ciągu znaków parametru została skopiowana do zmiennej lokalnej :cdata:`command`. To jest przypisanie wskaźnika i nie powinieneś zmieniać ciągu znaków na który on wskazuje (więc w Standardowym C, zmienna :cdata:`command` powinna odpowiednio być zadeklarowana jako ``const char *command``).

source: The next statement is a call to the Unix function :cfunc:`system`, passing it the string we just got from :cfunc:`PyArg_ParseTuple`::
pl: Następne wyrażenie jest wezwaniem zadania Unix-a :cfunc:`system`, przekazując mu ciąg znaków, który właśnie otrzymaliśmy z :cfunc:`PyArg_ParseTuple`::

source: Our :func:`spam.system` function must return the value of :cdata:`sts` as a Python object. This is done using the function :cfunc:`Py_BuildValue`, which is something like the inverse of :cfunc:`PyArg_ParseTuple`: it takes a format string and an arbitrary number of C values, and returns a new Python object. More info on :cfunc:`Py_BuildValue` is given later. ::
pl: Nasze zadanie :func:`spam.system` musi zwracać wartość :cdata:`sts` jako przedmiot języka pytonowskiego. To jest czynione używając zadania :cfunc:`Py_BuildValue`, która jest czymś podobnym do odwrotności :cfunc:`PyArg_ParseTuple`: bierze ona ciąg formatowania i dowolną liczbę wartości C, i zwraca nowy przedmiot języka pytonowskiego. Więcej informacji o :cfunc:`Py_BuildValue` jest podana później. ::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
pl: W tym przypadku, zwróci przedmiot liczby całkowitej (Tak, nawet liczby całkowite są przedmiotami na stercie w języku pytonowskim!)

source: If you have a C function that returns no useful argument (a function returning :ctype:`void`), the corresponding Python function must return ``None``. You need this idiom to do so (which is implemented by the :cmacro:`Py_RETURN_NONE` macro)::
pl: Jeśli masz zadanie C które nie zwraca żadnych użytecznych parametrów (zadanie zwracające :ctype:`void`), odpowiadające zadanie języka pytonowskiego musi zwracać ``None``. Potrzebujesz tego idiomu aby to uczynić (który jest wypełniony przez makrodefinicję :cmacro:`Py_RETURN_NONE`)::

source: :cdata:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a *NULL* pointer, which means "error" in most contexts, as we have seen.
pl: :cdata:`Py_None` jest nazwą C dla szczególnego przedmiotu języka pytonowskiego ``None``. Jest to prawdziwy przedmiot języka pytonowskiego zamiast pustego wskaźnika - z ang. - *NULL*, co oznacza "błąd" w większości przypadków, jak już widzieliśmy.

source: The Module's Method Table and Initialization Function
pl: Zadanie zainicjowania i tabela sposobów postępowania modułu.

source: I promised to show how :cfunc:`spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
pl: Obiecywałem pokazać jak :cfunc:`spam_system` jest wywoływana z programu języka pytonowskiego. Najpierw musimy wypisać jej nazwę i adres w "tabeli sposobów postępowania"::

source: static PyMethodDef SpamMethods[] = { ... {"system", spam_system, METH_VARARGS, "Execute a shell command."}, ... {NULL, NULL, 0, NULL} /* Sentinel */ };
pl: static PyMethodDef SpamMethods[] = { ... {"system", spam_system, METH_VARARGS, "Uruchom polecenie powłoki."}, ... {NULL, NULL, 0, NULL} /* pilnowacz */ };

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :cfunc:`PyArg_ParseTuple` is used.
pl: Zauważ trzeci wpis (``METH_VARARGS``). To jest flaga mówiąca programowi interpretującemu polecenia języka pytonowskiego o konwencji która ma zostać użyta dla zadania C. Zwykle zawsze powinna to być ``METH_VARARGS`` lub ``METH_VARARGS | METH_KEYWORDS``; wartość ``0`` oznacza że przestarzały wariant zadania :cfunc:`PyArg_ParseTuple` jest używany.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :cfunc:`PyArg_ParseTuple`; more information on this function is provided below.
pl: Gdy w użyciu jest tylko ``METH_VARARGS``, zadanie powinno spodziewać się parametrów na poziomie języka pytonowskiego aby były przekazywane jako dwójka akceptowalna do wczytania przez :cfunc:`PyArg_ParseTuple`; więcej informacji o tym zadaniu jest dostarczone poniżej.

source: The :const:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject \*`` parameter which will be a dictionary of keywords. Use :cfunc:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
pl: Bit :const:`METH_KEYWORDS` może być ustawiany w trzecim polu jeśli parametry słów kluczowych miałyby być przekazywane do zadania. W takim przypadku, zadanie C powinno akceptować trzeci parametr ``PyObject \*``, który będzie słownikiem słów kluczowych. Użyj zadania :cfunc:`PyArg_ParseTupleAndKeywords` aby wczytać parametry takiego zadania.

source: The method table must be referenced in the module definition structure::
pl: Tabela sposobów postępowania musi być określona w strukturze definicji modułu::

source: static struct PyModuleDef spammodule = { PyModuleDef_HEAD_INIT, "spam", /* name of module */ spam_doc, /* module documentation, may be NULL */ -1, /* size of per-interpreter state of the module, or -1 if the module keeps state in global variables. */ SpamMethods };
pl: static struct PyModuleDef spammodule = { PyModuleDef_HEAD_INIT, "spam", /*nazwa modułu */ spam_doc, /* dokumentacja modułu, może być pusta (NULL) */ -1, /* rozmiar stanu modułu dla programu interpretującego polecenia języka pytonowskiego, lub -1 jeśli moduł utrzymuje stan w nadrzędnych zmiennych. */ SpamMethods };

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :cfunc:`PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
pl: Ta struktura, z kolei, musi być przekazana do programu interpretującego polecenia języka pytonowskiego w zadaniu inicjującym moduł. Zadanie inicjujące musi się nazywać :cfunc:`PyInit_nazwa`, gdzie *nazwa* jest nazwą modułu, i powinna być jedynym nie-\ ``statycznym`` elementem określonym w pliku modułu::

source: Note that PyMODINIT_FUNC declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
pl: Zauważ że PyMODINIT_FUNC deklaruje zadanie jako zwrotny typ ``PyObject *``, deklaruje wszelkie specjalne deklaracje połączeń wymagane przez maszynę/środowisko, i dla C++ deklaruje zadanie jako ``extern "C"``.

source: When the Python program imports module :mod:`spam` for the first time, :cfunc:`PyInit_spam` is called. (See below for comments about embedding Python.) It calls :cfunc:`PyModule_Create`, which returns a module object, and inserts built-in function objects into the newly created module based upon the table (an array of :ctype:`PyMethodDef` structures) found in the module definition. :cfunc:`PyModule_Create` returns a pointer to the module object that it creates. It may abort with a fatal error for certain errors, or return *NULL* if the module could not be initialized satisfactorily. The init function must return the module object to its caller, so that it then gets inserted into ``sys.modules``.
pl: Gdy program języka pytonowskiego importuje moduł :mod:`spam` po raz pierwszy, zadanie :cfunc:`PyInit_spam` jest wzywane. (Zobacz poniższe komentarze o załączaniu języka pytonowskiego.) Wzywa zadanie :cfunc:`PyModule_Create`, które zwraca przedmiot modułu, i wstawia przedmioty wbudowanych zadań do nowo utworzonego modułu w oparciu o tabelę (rząd struktur :ctype:`PyMethodDef`) znajdujących się w definicji modułu. :cfunc:`PyModule_Create` zwraca wskaźnik do przedmiotu modułu który tworzy. Może przerwać z krytycznym błędem dla pewnych błędów, lub zwrócić *NULL* jeśli moduł nie mógł być zainicjowany satysfakcjonująco. Zadanie inicjujące musi zwrócić przedmiot modułu do swojego wywołującego, tak żeby było następnie wstawione do ``sys.modules``.

source: When embedding Python, the :cfunc:`PyInit_spam` function is not called automatically unless there's an entry in the :cdata:`PyImport_Inittab` table. To add the module to the initialization table, use :cfunc:`PyImport_AppendInittab`, optionally followed by an import of the module::
pl: Przy załączaniu języka pytonowskiego, zadanie :cfunc:`PyInit_spam` nie jest wzywane automatycznie chyba, że istnieje wpis w tabeli :cdata:`PyImport_Inittab`. Aby dodać moduł do tabeli zainicjowania użyj :cfunc:`PyImport_AppendInittab`, z dodatkową możliwością następnie importowania modułu::

source: int main(int argc, char *argv[]) { /* Add a built-in module, before Py_Initialize */ PyImport_AppendInittab("spam", PyInit_spam); /* Pass argv[0] to the Python interpreter */ Py_SetProgramName(argv[0]); /* Initialize the Python interpreter. Required. */ Py_Initialize(); /* Optionally import the module; alternatively, import can be deferred until the embedded script imports it. */ PyImport_ImportModule("spam");
pl: int main(int argc, char *argv[]) { /* Dodaj wbudowany moduł, przed Py_Initialize */ PyImport_AppendInittab("spam", PyInit_spam); /* Przekaż argv[0] do programu interpretującego polecenia języka pytonowskiego */ Py_SetProgramName(argv[0]); /* Inicjuj program interpretujący polecenia języka pytonowskiego. Wymagane. */ Py_Initialize(); /* Opcjonalnie importuj moduł; alternatywnie, import może być opóźniony aż do momentu gdy załączony skrypt go zaimportuje. */ PyImport_ImportModule("spam");

source: An example may be found in the file :file:`Demo/embed/demo.c` in the Python source distribution.
pl: Przykład można znaleźć w pliku :file:`Demo/embed/demo.c` w dystrybucji źródłowej języka pytonowskiego.

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :cfunc:`fork` without an intervening :cfunc:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
pl: Usuwanie wpisów z ``sys.modules`` lub importowanie skompilowanych modułów do wielu interpreterów wewnątrz procesu (lub postępując za rozwidleniem :cfunc:`fork` bez przerwy ze strony :cfunc:`exec`) może tworzyć problemy dla niektórych modułów rozszerzających. Twórcy modułów rozszerzających powinni wzmóc czujność podczas inicjowania wewnętrznych struktur danych.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
pl: Bardziej konkretny przykład modułu jest załączony w dystrybucji źródeł języka pytonowskiego jako plik :file:`Modules/xxmodule.c`. Ten plik może być użyty jako wzór lub po prostu czytany jako przykład.

source: Compilation and Linkage
pl: Kompilacja i łączenie

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
pl: Są jeszcze dwie rzeczy które trzeba zrobić zanim będzie można użyć nowego rozszerzenia: skompilowanie go i podłączenie z systemem języka pytonowskiego. Jeśli używasz dynamicznego ładowania, szczegóły mogą zależeć od stylu dynamicznego ładowania którego twój system używa; zobacz rozdział o budowaniu rozszerzających modułów (rozdział :ref:`budowanie`) i dodatkowe informacje które odnoszą się tylko do budowania w Windows (rozdział :ref:`budowanie-w-windows`) po więcej informacji na ten temat.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file::
pl: Jeśli nie możesz użyć dynamicznego ładowania, lub jeśli chcesz uczynić swój moduł trwałą częścią programu interpretującego polecenia języka pytonowskiego, będziesz musiał zmienić ustawienia konfiguracyjne i przebudować program interpretujący polecenia języka pytonowskiego. Na szczęście jest to bardzo proste w Unix-ie: po prostu wstaw swój plik (:file:`spammodule.c` dla przykładu) w katalogu :file:`Modules/` odpakowanej dystrybucji źródłowej, dodaj linię do pliku :file:`Modules/Setup.local` opisującą twój plik::
